# 1. Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника.
# В расчете необходимо использовать формулу: (выработка в часах * ставка в час) + премия.
# Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.

from sys import argv


hours_worked, salary_per_hour, bonus = map(float, argv[1:])
print("Salary = ", hours_worked * salary_per_hour + bonus)
